In [168]:
import numpy as np
import pandas as pd

Aula 3: estrutura unidimensional e bidimensional

In [169]:
# ex 1 - Panda Series

s = pd.Series([10,20,30,40,50], name='clt')
e = pd.Series([1,2,3,4,5], name='pj')
smh = pd.Series(['MI','MA','EJ','JD','OS'],name='fon')

# se = s ^ e
# print(se)

print(s)
print(e)

0    10
1    20
2    30
3    40
4    50
Name: clt, dtype: int64
0    1
1    2
2    3
3    4
4    5
Name: pj, dtype: int64

In [170]:
dados_clt = pd.DataFrame({'clt1': s,'cnpjoto': e,'smh': smh})
dados_clt['clthanos'] = dados_clt['clt1'] + dados_clt['cnpjoto']

dados_clt

   clt1  cnpjoto smh  clthanos
0    10        1  MI        11
1    20        2  MA        22
2    30        3  EJ        33
3    40        4  JD        44
4    50        5  OS        55

In [171]:
dados_clt['iguabinha'] = dados_clt['clt1']-dados_clt['cnpjoto']
dados_clt

   clt1  cnpjoto smh  clthanos  iguabinha
0    10        1  MI        11          9
1    20        2  MA        22         18
2    30        3  EJ        33         27
3    40        4  JD        44         36
4    50        5  OS        55         45

In [172]:
dados_clt['the rot consumes'] = dados_clt['clt1'] / dados_clt['cnpjoto']
dados_clt

   clt1  cnpjoto smh  clthanos  iguabinha  the rot consumes
0    10        1  MI        11          9              10.0
1    20        2  MA        22         18              10.0
2    30        3  EJ        33         27              10.0
3    40        4  JD        44         36              10.0
4    50        5  OS        55         45              10.0

In [173]:
dados_clt['ximira Peixola'] = dados_clt['clt1']* dados_clt['cnpjoto']
dados_clt

   clt1  cnpjoto smh  clthanos  iguabinha  the rot consumes  ximira Peixola
0    10        1  MI        11          9              10.0              10
1    20        2  MA        22         18              10.0              40
2    30        3  EJ        33         27              10.0              90
3    40        4  JD        44         36              10.0             160
4    50        5  OS        55         45              10.0             250

In [174]:
dados_clt['yo fon linging']= dados_clt['clt1'] % dados_clt['cnpjoto']
dados_clt

,clt1,cnpjoto,smh,clthanos,iguabinha,the rot consumes,ximira Peixola,yo fon linging
0,10,1,MI,11,9,10.0,10,0
1,20,2,MA,22,18,10.0,40,0
2,30,3,EJ,33,27,10.0,90,0
3,40,4,JD,44,36,10.0,160,0
4,50,5,OS,55,45,10.0,250,0

In [175]:
matriz = np.array([[1,2,3],[4,5,6]])
matriz

array([[1, 2, 3],
       [4, 5, 6]])

In [176]:
resultado = matriz * 2
resultado

array([[ 2,  4,  6],
       [ 8, 10, 12]])

In [177]:
elemento = matriz[1,2]
elemento

6

In [178]:
# estatística basica

media = np.mean(matriz)
media

3.5

In [179]:
desvio_padrao = np.std([1,3,1,5,2,7])
desvio_padrao

2.1921577396609844

In [180]:
arraia_a_jato = []
for i in range(100):
    arraia_a_jato.append(i)
    
ball = pd.Series(arraia_a_jato, name='cano')

In [181]:
print(ball[3])

3

In [182]:
ximira = pd.Series([1,2,3,4,5],name='ximira')
xelo = pd.Series([6,7,8,9,10],name='xelo')

ximira + xelo

0     7
1     9
2    11
3    13
4    15
dtype: int64

In [183]:
ximiraXelo = pd.Series([1,2,3,4,5,6,7,8,9,10], name='ximiraXelo')
for i in range(len(ximiraXelo)):
    if ximiraXelo[i]>=5:
        print(ximiraXelo[i])

5
6
7
8
9
10

In [184]:
print(ximiraXelo.mean())
print(ximiraXelo.std())

5.5
3.0276503540974917

In [185]:
ximiraXelo_the_returnal = pd.concat([ximira,xelo])
ximiraXelo_the_returnal

0     1
1     2
2     3
3     4
4     5
0     6
1     7
2     8
3     9
4    10
dtype: int64

In [186]:
positiva = pd.Series([0,1,2,3,4,5,6,7,8,9,10],name='positiva')
negativa = pd.Series([10,9,8,7,6,5,4,3,2,1,0],name='negativa')

negativa-positiva

0     10
1      8
2      6
3      4
4      2
5      0
6     -2
7     -4
8     -6
9     -8
10   -10
dtype: int64

In [187]:
ximiraInverso=reversed(ximiraXelo)
pdInversoDoXimiraInverso = []
for i in ximiraInverso:
    pdInversoDoXimiraInverso.append(i)
pdLa = pd.Series(pdInversoDoXimiraInverso,name='isso')

pdLa

0    10
1     9
2     8
3     7
4     6
5     5
6     4
7     3
8     2
9     1
Name: isso, dtype: int64

In [188]:
ximiraXelo.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: ximiraXelo, dtype: bool

In [189]:
print(ximiraXelo[2:7])

2    3
3    4
4    5
5    6
6    7
Name: ximiraXelo, dtype: int64

In [190]:
'''Uma loja de eletronicos deseja analisar seus dados de vendas para entender melhor o desempenho
de seus produtos ao longo do tempo. eles possuem um arquivo CSV com informações sobre as vendas de vários produtos ai longo
dos meses. o objetivo é usar o pandas series para realizar algumas análises básicas e responder algumas perguntas sobre os dados de vendas'''
linha_produto = pd.Series(['celular','celular','celular','tablet','tablet','tablet','notebook','notebook','notebook','notebook'], name='Produto')
linha_mes = pd.Series(['jan-2023','fev-2023','mar-2023','jan-2023','fev-2023','mar-2023','jan-2023','fev-2023','mar-2023','fev-2023'], name = ' mes')
linha_vendas = pd.Series([150,180,200,100,120,130,80,90,100,400], name='vendas')

db = pd.DataFrame({'Produto': linha_produto, 'mes': linha_mes, 'vendas': linha_vendas})

db.to_csv(path_or_buf='aula 22.08.2024')

In [191]:
db.groupby(['Produto','mes'])['vendas'].sum()

Produto   mes
celular   fev-2023    180
          jan-2023    150
          mar-2023    200
notebook  fev-2023    490
          jan-2023     80
          mar-2023    100
tablet    fev-2023    120
          jan-2023    100
          mar-2023    130
Name: vendas, dtype: int64